zephyrproject-rtos/zephyr/include/dt-bindings/pinctrl/gd32-pinctrl.h
/*
 * Copyright (c) 2017 Linaro Limited
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_GD32_PINCTRL_COMMON_H_
#define ZEPHYR_GD32_PINCTRL_COMMON_H_

/**
 * @brief numerical IDs for IO ports
 */

#define	GD32_PORTA 0	/* IO port A */
#define	GD32_PORTB 1	/* .. */
#define	GD32_PORTC 2
#define	GD32_PORTD 3
#define	GD32_PORTE 4
#define	GD32_PORTF 5
#define	GD32_PORTG 6
#define	GD32_PORTH 7
#define	GD32_PORTI 8
#define	GD32_PORTJ 9
#define	GD32_PORTK 10	/* IO port K */

#ifndef GD32_PORTS_MAX
#define GD32_PORTS_MAX (GD32_PORTK + 1)
#endif

#define GD32_PINMUX_FUNC_GPIO 0
#define GD32_PINMUX_FUNC_ANALOG (GD32_PINMUX_FUNC_ALT_MAX)

/**
 * @brief helper macro to encode an IO port pin in a numerical format
 */
#define GD32PIN(_port, _pin) \
	(_port << 4 | _pin)

#define GD32_PIN_PA0	GD32PIN(GD32_PORTA, 0)
#define GD32_PIN_PA1	GD32PIN(GD32_PORTA, 1)
#define GD32_PIN_PA2	GD32PIN(GD32_PORTA, 2)
#define GD32_PIN_PA3	GD32PIN(GD32_PORTA, 3)
#define GD32_PIN_PA4	GD32PIN(GD32_PORTA, 4)
#define GD32_PIN_PA5	GD32PIN(GD32_PORTA, 5)
#define GD32_PIN_PA6	GD32PIN(GD32_PORTA, 6)
#define GD32_PIN_PA7	GD32PIN(GD32_PORTA, 7)
#define GD32_PIN_PA8	GD32PIN(GD32_PORTA, 8)
#define GD32_PIN_PA9	GD32PIN(GD32_PORTA, 9)
#define GD32_PIN_PA10  GD32PIN(GD32_PORTA, 10)
#define GD32_PIN_PA11  GD32PIN(GD32_PORTA, 11)
#define GD32_PIN_PA12  GD32PIN(GD32_PORTA, 12)
#define GD32_PIN_PA13  GD32PIN(GD32_PORTA, 13)
#define GD32_PIN_PA14  GD32PIN(GD32_PORTA, 14)
#define GD32_PIN_PA15  GD32PIN(GD32_PORTA, 15)

#define GD32_PIN_PB0	GD32PIN(GD32_PORTB, 0)
#define GD32_PIN_PB1	GD32PIN(GD32_PORTB, 1)
#define GD32_PIN_PB2	GD32PIN(GD32_PORTB, 2)
#define GD32_PIN_PB3	GD32PIN(GD32_PORTB, 3)
#define GD32_PIN_PB4	GD32PIN(GD32_PORTB, 4)
#define GD32_PIN_PB5	GD32PIN(GD32_PORTB, 5)
#define GD32_PIN_PB6	GD32PIN(GD32_PORTB, 6)
#define GD32_PIN_PB7	GD32PIN(GD32_PORTB, 7)
#define GD32_PIN_PB8	GD32PIN(GD32_PORTB, 8)
#define GD32_PIN_PB9	GD32PIN(GD32_PORTB, 9)
#define GD32_PIN_PB10  GD32PIN(GD32_PORTB, 10)
#define GD32_PIN_PB11  GD32PIN(GD32_PORTB, 11)
#define GD32_PIN_PB12  GD32PIN(GD32_PORTB, 12)
#define GD32_PIN_PB13  GD32PIN(GD32_PORTB, 13)
#define GD32_PIN_PB14  GD32PIN(GD32_PORTB, 14)
#define GD32_PIN_PB15  GD32PIN(GD32_PORTB, 15)

#define GD32_PIN_PC0	GD32PIN(GD32_PORTC, 0)
#define GD32_PIN_PC1	GD32PIN(GD32_PORTC, 1)
#define GD32_PIN_PC2	GD32PIN(GD32_PORTC, 2)
#define GD32_PIN_PC3	GD32PIN(GD32_PORTC, 3)
#define GD32_PIN_PC4	GD32PIN(GD32_PORTC, 4)
#define GD32_PIN_PC5	GD32PIN(GD32_PORTC, 5)
#define GD32_PIN_PC6	GD32PIN(GD32_PORTC, 6)
#define GD32_PIN_PC7	GD32PIN(GD32_PORTC, 7)
#define GD32_PIN_PC8	GD32PIN(GD32_PORTC, 8)
#define GD32_PIN_PC9	GD32PIN(GD32_PORTC, 9)
#define GD32_PIN_PC10  GD32PIN(GD32_PORTC, 10)
#define GD32_PIN_PC11  GD32PIN(GD32_PORTC, 11)
#define GD32_PIN_PC12  GD32PIN(GD32_PORTC, 12)
#define GD32_PIN_PC13  GD32PIN(GD32_PORTC, 13)
#define GD32_PIN_PC14  GD32PIN(GD32_PORTC, 14)
#define GD32_PIN_PC15  GD32PIN(GD32_PORTC, 15)

#define GD32_PIN_PD0	GD32PIN(GD32_PORTD, 0)
#define GD32_PIN_PD1	GD32PIN(GD32_PORTD, 1)
#define GD32_PIN_PD2	GD32PIN(GD32_PORTD, 2)
#define GD32_PIN_PD3	GD32PIN(GD32_PORTD, 3)
#define GD32_PIN_PD4	GD32PIN(GD32_PORTD, 4)
#define GD32_PIN_PD5	GD32PIN(GD32_PORTD, 5)
#define GD32_PIN_PD6	GD32PIN(GD32_PORTD, 6)
#define GD32_PIN_PD7	GD32PIN(GD32_PORTD, 7)
#define GD32_PIN_PD8	GD32PIN(GD32_PORTD, 8)
#define GD32_PIN_PD9	GD32PIN(GD32_PORTD, 9)
#define GD32_PIN_PD10  GD32PIN(GD32_PORTD, 10)
#define GD32_PIN_PD11  GD32PIN(GD32_PORTD, 11)
#define GD32_PIN_PD12  GD32PIN(GD32_PORTD, 12)
#define GD32_PIN_PD13  GD32PIN(GD32_PORTD, 13)
#define GD32_PIN_PD14  GD32PIN(GD32_PORTD, 14)
#define GD32_PIN_PD15  GD32PIN(GD32_PORTD, 15)

#define GD32_PIN_PE0	GD32PIN(GD32_PORTE, 0)
#define GD32_PIN_PE1	GD32PIN(GD32_PORTE, 1)
#define GD32_PIN_PE2	GD32PIN(GD32_PORTE, 2)
#define GD32_PIN_PE3	GD32PIN(GD32_PORTE, 3)
#define GD32_PIN_PE4	GD32PIN(GD32_PORTE, 4)
#define GD32_PIN_PE5	GD32PIN(GD32_PORTE, 5)
#define GD32_PIN_PE6	GD32PIN(GD32_PORTE, 6)
#define GD32_PIN_PE7	GD32PIN(GD32_PORTE, 7)
#define GD32_PIN_PE8	GD32PIN(GD32_PORTE, 8)
#define GD32_PIN_PE9	GD32PIN(GD32_PORTE, 9)
#define GD32_PIN_PE10  GD32PIN(GD32_PORTE, 10)
#define GD32_PIN_PE11  GD32PIN(GD32_PORTE, 11)
#define GD32_PIN_PE12  GD32PIN(GD32_PORTE, 12)
#define GD32_PIN_PE13  GD32PIN(GD32_PORTE, 13)
#define GD32_PIN_PE14  GD32PIN(GD32_PORTE, 14)
#define GD32_PIN_PE15  GD32PIN(GD32_PORTE, 15)

#define GD32_PIN_PF0	GD32PIN(GD32_PORTF, 0)
#define GD32_PIN_PF1	GD32PIN(GD32_PORTF, 1)
#define GD32_PIN_PF2	GD32PIN(GD32_PORTF, 2)
#define GD32_PIN_PF3	GD32PIN(GD32_PORTF, 3)
#define GD32_PIN_PF4	GD32PIN(GD32_PORTF, 4)
#define GD32_PIN_PF5	GD32PIN(GD32_PORTF, 5)
#define GD32_PIN_PF6	GD32PIN(GD32_PORTF, 6)
#define GD32_PIN_PF7	GD32PIN(GD32_PORTF, 7)
#define GD32_PIN_PF8	GD32PIN(GD32_PORTF, 8)
#define GD32_PIN_PF9	GD32PIN(GD32_PORTF, 9)
#define GD32_PIN_PF10  GD32PIN(GD32_PORTF, 10)
#define GD32_PIN_PF11  GD32PIN(GD32_PORTF, 11)
#define GD32_PIN_PF12  GD32PIN(GD32_PORTF, 12)
#define GD32_PIN_PF13  GD32PIN(GD32_PORTF, 13)
#define GD32_PIN_PF14  GD32PIN(GD32_PORTF, 14)
#define GD32_PIN_PF15  GD32PIN(GD32_PORTF, 15)

#define GD32_PIN_PG0	GD32PIN(GD32_PORTG, 0)
#define GD32_PIN_PG1	GD32PIN(GD32_PORTG, 1)
#define GD32_PIN_PG2	GD32PIN(GD32_PORTG, 2)
#define GD32_PIN_PG3	GD32PIN(GD32_PORTG, 3)
#define GD32_PIN_PG4	GD32PIN(GD32_PORTG, 4)
#define GD32_PIN_PG5	GD32PIN(GD32_PORTG, 5)
#define GD32_PIN_PG6	GD32PIN(GD32_PORTG, 6)
#define GD32_PIN_PG7	GD32PIN(GD32_PORTG, 7)
#define GD32_PIN_PG8	GD32PIN(GD32_PORTG, 8)
#define GD32_PIN_PG9	GD32PIN(GD32_PORTG, 9)
#define GD32_PIN_PG10  GD32PIN(GD32_PORTG, 10)
#define GD32_PIN_PG11  GD32PIN(GD32_PORTG, 11)
#define GD32_PIN_PG12  GD32PIN(GD32_PORTG, 12)
#define GD32_PIN_PG13  GD32PIN(GD32_PORTG, 13)
#define GD32_PIN_PG14  GD32PIN(GD32_PORTG, 14)
#define GD32_PIN_PG15  GD32PIN(GD32_PORTG, 15)

#define GD32_PIN_PH0	GD32PIN(GD32_PORTH, 0)
#define GD32_PIN_PH1	GD32PIN(GD32_PORTH, 1)
#define GD32_PIN_PH2	GD32PIN(GD32_PORTH, 2)
#define GD32_PIN_PH3	GD32PIN(GD32_PORTH, 3)
#define GD32_PIN_PH4	GD32PIN(GD32_PORTH, 4)
#define GD32_PIN_PH5	GD32PIN(GD32_PORTH, 5)
#define GD32_PIN_PH6	GD32PIN(GD32_PORTH, 6)
#define GD32_PIN_PH7	GD32PIN(GD32_PORTH, 7)
#define GD32_PIN_PH8	GD32PIN(GD32_PORTH, 8)
#define GD32_PIN_PH9	GD32PIN(GD32_PORTH, 9)
#define GD32_PIN_PH10  GD32PIN(GD32_PORTH, 10)
#define GD32_PIN_PH11  GD32PIN(GD32_PORTH, 11)
#define GD32_PIN_PH12  GD32PIN(GD32_PORTH, 12)
#define GD32_PIN_PH13  GD32PIN(GD32_PORTH, 13)
#define GD32_PIN_PH14  GD32PIN(GD32_PORTH, 14)
#define GD32_PIN_PH15  GD32PIN(GD32_PORTH, 15)

#define GD32_PIN_PI0	GD32PIN(GD32_PORTI, 0)
#define GD32_PIN_PI1	GD32PIN(GD32_PORTI, 1)
#define GD32_PIN_PI2	GD32PIN(GD32_PORTI, 2)
#define GD32_PIN_PI3	GD32PIN(GD32_PORTI, 3)
#define GD32_PIN_PI4	GD32PIN(GD32_PORTI, 4)
#define GD32_PIN_PI5	GD32PIN(GD32_PORTI, 5)
#define GD32_PIN_PI6	GD32PIN(GD32_PORTI, 6)
#define GD32_PIN_PI7	GD32PIN(GD32_PORTI, 7)
#define GD32_PIN_PI8	GD32PIN(GD32_PORTI, 8)
#define GD32_PIN_PI9	GD32PIN(GD32_PORTI, 9)
#define GD32_PIN_PI10  GD32PIN(GD32_PORTI, 10)
#define GD32_PIN_PI11  GD32PIN(GD32_PORTI, 11)
#define GD32_PIN_PI12  GD32PIN(GD32_PORTI, 12)
#define GD32_PIN_PI13  GD32PIN(GD32_PORTI, 13)
#define GD32_PIN_PI14  GD32PIN(GD32_PORTI, 14)
#define GD32_PIN_PI15  GD32PIN(GD32_PORTI, 15)

#define GD32_PIN_PJ0	GD32PIN(GD32_PORTJ, 0)
#define GD32_PIN_PJ1	GD32PIN(GD32_PORTJ, 1)
#define GD32_PIN_PJ2	GD32PIN(GD32_PORTJ, 2)
#define GD32_PIN_PJ3	GD32PIN(GD32_PORTJ, 3)
#define GD32_PIN_PJ4	GD32PIN(GD32_PORTJ, 4)
#define GD32_PIN_PJ5	GD32PIN(GD32_PORTJ, 5)
#define GD32_PIN_PJ6	GD32PIN(GD32_PORTJ, 6)
#define GD32_PIN_PJ7	GD32PIN(GD32_PORTJ, 7)
#define GD32_PIN_PJ8	GD32PIN(GD32_PORTJ, 8)
#define GD32_PIN_PJ9	GD32PIN(GD32_PORTJ, 9)
#define GD32_PIN_PJ10  GD32PIN(GD32_PORTJ, 10)
#define GD32_PIN_PJ11  GD32PIN(GD32_PORTJ, 11)
#define GD32_PIN_PJ12  GD32PIN(GD32_PORTJ, 12)
#define GD32_PIN_PJ13  GD32PIN(GD32_PORTJ, 13)
#define GD32_PIN_PJ14  GD32PIN(GD32_PORTJ, 14)
#define GD32_PIN_PJ15  GD32PIN(GD32_PORTJ, 15)

#define GD32_PIN_PK0	GD32PIN(GD32_PORTK, 0)
#define GD32_PIN_PK1	GD32PIN(GD32_PORTK, 1)
#define GD32_PIN_PK2	GD32PIN(GD32_PORTK, 2)
#define GD32_PIN_PK3	GD32PIN(GD32_PORTK, 3)
#define GD32_PIN_PK4	GD32PIN(GD32_PORTK, 4)
#define GD32_PIN_PK5	GD32PIN(GD32_PORTK, 5)
#define GD32_PIN_PK6	GD32PIN(GD32_PORTK, 6)
#define GD32_PIN_PK7	GD32PIN(GD32_PORTK, 7)
#define GD32_PIN_PK8	GD32PIN(GD32_PORTK, 8)
#define GD32_PIN_PK9	GD32PIN(GD32_PORTK, 9)
#define GD32_PIN_PK10  GD32PIN(GD32_PORTK, 10)
#define GD32_PIN_PK11  GD32PIN(GD32_PORTK, 11)
#define GD32_PIN_PK12  GD32PIN(GD32_PORTK, 12)
#define GD32_PIN_PK13  GD32PIN(GD32_PORTK, 13)
#define GD32_PIN_PK14  GD32PIN(GD32_PORTK, 14)
#define GD32_PIN_PK15  GD32PIN(GD32_PORTK, 15)

/**
 * @brief Macro to generate pinmux int using port, pin number and mode arguments
 */

#define PIN_NO(port, line)	(((port) - 'A') * 0x10 + (line))
#define GD32_PINMUX(port, line, mode, remap) \
			(((PIN_NO(port, line)) << 8) | (mode << 6) | (remap))

/**
 * @brief Pin modes
 */

#define ALTERNATE	0x0  /* Alternate function output */
#define GPIO_IN		0x1  /* Input */
#define ANALOG		0x2  /* Analog */

/**
 * @brief Pin remapping configurations
 */

#define NO_REMAP	0x0  /* No remapping */
#define REMAP_1		0x1  /* Partial remapping 1 */
#define REMAP_2		0x2  /* Partial remapping 2 */
#define REMAP_3		0x3  /* Partial remapping 3 */
#define REMAP_FULL	0x4  /* Full remapping */

/**
 * @brief PIN configuration bitfield
 *
 * Pin configuration is coded with the following
 * fields
 *    GPIO I/O Mode       [ 0 ]
 *    GPIO Input config   [ 1 : 2 ]
 *    GPIO Output speed   [ 3 : 4 ]
 *    GPIO Output PP/OD   [ 5 ]
 *    GPIO Output AF/GP   [ 6 ]
 *    GPIO PUPD Config    [ 7 : 8 ]
 *
 * Applicable to GD32F1 series
 */

/* Alternate functions */
/* GD32F1 Pinmux doesn't use explicit alternate functions */
/* These are kept for compatibility with other GD32 pinmux */
#define GD32_AFR_MASK			0
#define GD32_AFR_SHIFT			0

/* Port Mode */
#define GD32_MODE_INPUT		(0x0<<GD32_MODE_INOUT_SHIFT)
#define GD32_MODE_OUTPUT		(0x1<<GD32_MODE_INOUT_SHIFT)
#define GD32_MODE_INOUT_MASK		0x1
#define GD32_MODE_INOUT_SHIFT		0

/* Input Port configuration */
#define GD32_CNF_IN_ANALOG		(0x0<<GD32_CNF_IN_SHIFT)
#define GD32_CNF_IN_FLOAT		(0x1<<GD32_CNF_IN_SHIFT)
#define GD32_CNF_IN_PUPD		(0x2<<GD32_CNF_IN_SHIFT)
#define GD32_CNF_IN_MASK		0x3
#define GD32_CNF_IN_SHIFT		1

/* Output Port configuration */
#define GD32_MODE_OUTPUT_MAX_10	(0x0<<GD32_MODE_OSPEED_SHIFT)
#define GD32_MODE_OUTPUT_MAX_2		(0x1<<GD32_MODE_OSPEED_SHIFT)
#define GD32_MODE_OUTPUT_MAX_50	(0x2<<GD32_MODE_OSPEED_SHIFT)
#define GD32_MODE_OUTPUT_MAX_MAX	(0x3<<GD32_MODE_OSPEED_SHIFT)
#define GD32_MODE_OSPEED_MASK		0x3
#define GD32_MODE_OSPEED_SHIFT		3

#define GD32_CNF_PUSH_PULL		(0x0<<GD32_CNF_OUT_0_SHIFT)
#define GD32_CNF_OPEN_DRAIN		(0x1<<GD32_CNF_OUT_0_SHIFT)
#define GD32_CNF_OUT_0_MASK		0x1
#define GD32_CNF_OUT_0_SHIFT		5

#define GD32_CNF_GP_OUTPUT		(0x0<<GD32_CNF_OUT_1_SHIFT)
#define GD32_CNF_ALT_FUNC		(0x1<<GD32_CNF_OUT_1_SHIFT)
#define GD32_CNF_OUT_1_MASK		0x1
#define GD32_CNF_OUT_1_SHIFT		6

/* GPIO High impedance/Pull-up/Pull-down */
#define GD32_PUPD_NO_PULL		(0x0<<GD32_PUPD_SHIFT)
#define GD32_PUPD_PULL_UP		(0x1<<GD32_PUPD_SHIFT)
#define GD32_PUPD_PULL_DOWN		(0x2<<GD32_PUPD_SHIFT)
#define GD32_PUPD_MASK			0x3
#define GD32_PUPD_SHIFT		7

/* Alternate defines */
/* IO pin functions are mostly common across GD32 devices. Notable
 * exception is GD32F1 as these MCUs do not have registers for
 * configuration of pin's alternate function. The configuration is
 * done implicitly by setting specific mode and config in MODE and CNF
 * registers for particular pin.
 */
#define GD32_ALTERNATE			(GD32_MODE_OUTPUT | GD32_CNF_ALT_FUNC)

#define GD32_PIN_USART_TX		(GD32_ALTERNATE | GD32_CNF_PUSH_PULL)
#define GD32_PIN_USART_RX		(GD32_MODE_INPUT | GD32_CNF_IN_FLOAT)
#define GD32_PIN_I2C			(GD32_ALTERNATE | GD32_CNF_OPEN_DRAIN)
#define GD32_PIN_PWM			(GD32_ALTERNATE | GD32_CNF_PUSH_PULL)
#define GD32_PIN_SPI_MASTER_SCK	(GD32_ALTERNATE | GD32_CNF_PUSH_PULL)
#define GD32_PIN_SPI_SLAVE_SCK		(GD32_MODE_INPUT | GD32_CNF_IN_FLOAT)
#define GD32_PIN_SPI_MASTER_MOSI	(GD32_ALTERNATE | GD32_CNF_PUSH_PULL)
#define GD32_PIN_SPI_SLAVE_MOSI	(GD32_MODE_INPUT | GD32_CNF_IN_FLOAT)
#define GD32_PIN_SPI_MASTER_MISO	(GD32_MODE_INPUT | GD32_CNF_IN_FLOAT)
#define GD32_PIN_SPI_SLAVE_MISO	(GD32_ALTERNATE | GD32_CNF_PUSH_PULL)
#define GD32_PIN_CAN_TX		(GD32_ALTERNATE | GD32_CNF_PUSH_PULL)
#define GD32_PIN_CAN_RX		(GD32_MODE_INPUT  | GD32_PUPD_PULL_UP)

/*
 * Reference manual (RM0008)
 * Section 25.3.1: Slave select (NSS) pin management
 *
 * Hardware NSS management:
 * - NSS output disabled: allows multimaster capability for devices operating
 *   in master mode.
 * - NSS output enabled: used only when the device operates in master mode.
 *
 * Software NSS management:
 * - External NSS pin remains free for other application uses.
 *
 */

/* Hardware master NSS output disabled */
#define GD32_PIN_SPI_MASTER_NSS	(GD32_MODE_INPUT | GD32_CNF_IN_FLOAT)
/* Hardware master NSS output enabled */
#define GD32_PIN_SPI_MASTER_NSS_OE	(GD32_MODE_OUTPUT | \
						GD32_CNF_ALT_FUNC | \
						GD32_CNF_PUSH_PULL)
#define GD32_PIN_SPI_SLAVE_NSS		(GD32_MODE_INPUT | GD32_CNF_IN_FLOAT)
#define GD32_PIN_USB			(GD32_MODE_INPUT | GD32_CNF_IN_PUPD)


#endif	/* ZEPHYR_GD32_PINCTRL_COMMON_H_ */
